reo-sato/pokerapp/firmware/esp32s3-pn5180-ccid/sdkconfig.defaults
# ESP32-S3 + TinyUSB(CCID) 既定 sdkconfig。idf.py reconfigure で反映。
CONFIG_IDF_TARGET="esp32s3"

# --- コンソール（重要）---
# ESP32-S3 既定の「USB-Serial/JTAG セカンダリコンソール」は TinyUSB(USB-OTG)と同じ内蔵 USB PHY を
# 奪い合い、CCID デバイスが起動失敗(Error)する原因になる。よって:
#   - プライマリコンソール = UART0（= CP2102N 側。ログ ESP_LOGI はここに出る）
#   - セカンダリ(USB-Serial/JTAG) = 無効
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- FreeRTOS / ログ ---
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# 注: TinyUSB は esp_tinyusb 依存 + tinyusb_driver_install() で有効。CONFIG_TINYUSB_* は不要
#     （旧 Kconfig 名。設定しても unknown symbol 警告になるだけ）。
# 注: フラッシュ/PSRAM はモジュールに合わせて menuconfig で（既定は触らない）。
